backend/forms/Site/LoginForm.php

    public function login()
    {
        if($this->validate())
        {
            $user_identity = $this->getUserIdentity();
            $result = Yii::$app->user->login($user_identity);
            $AdminLoginLog = new AdminLoginLogExtends();
            $data['AdminLoginLogExtends'] = [
                'userid'  => $user_identity->userid,
                'ip'      => isset($_SERVER['HTTP_X_REAL_IP']) ? $_SERVER['HTTP_X_REAL_IP'] : Yii::$app->request->getUserIP(),
            ];
            if($result)
            {
                $data['AdminLoginLogExtends']['succeed'] = 1;
            } else {
                $data['AdminLoginLogExtends']['succeed'] = 0;
                $this->addError('password', '登录失败');
            }
            $AdminLoginLog->load($data) && $AdminLoginLog->save();
---
INSERT INTO `mostop_admin_login_log` (`userid`, `ip`, `succeed`, `created_at`) VALUES ('1', '127.0.0.1', 1, '1566460418')